Revit 2026 API

# TextElementText Property

---

The content of the element as a plain string stripped of all formating.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Text { get; set; }
```
```vb
Public Property Text As String
	Get
	Set
```
```cpp
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Text : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

If a new text content is set, all previous formating that might have been set on parts of the original text will be lost. After setting the new text, only the formating parameters of the associated text type will be applied.

The value of this property can also be accessed via the TEXT_TEXT Built-In parameter.

#### Reference

TextElement Class

Autodesk.Revit.DB Namespace